Revit 2027 API
InsulationMaterial Properties
The InsulationMaterial type exposes the following members.
Properties
Name | Description
Id |  The Conductor Insulation Material id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Insulation Material name.
Top
See Also
Reference
InsulationMaterial Class
Autodesk.Revit.DB.Electrical Namespace